WELCOME_MESSAGE = ("Привет, {0.first_name}!\nЭто бот команды Go Study СурГУ, "
                   "созданный для решения множества твоих рутинных проблем.")

FUNCTION_MESSAGE = ("Вот функции, которыми ты можешь здесь воспользоваться:\n\n"
                    "Получить свое расписание\n"
                    "Получить расписание преподавателя\n"
                    "Узнать расписание звонков\n"
                    "Числитель \ Знаменатель\n"
                    "Узнать ФИО преподавателя\n")

get_tt = "Вот твое расписание"

end_registration = "Отлично, я сохранил номер твоей группы"

REGISTRATION_MESSAGE = ("Но сначала давай познакомимся. \nНапиши, пожалуйста номер своей группы,"
                        " чтобы я мог тебе помочь.\n Формат записи - 601-21 \n Для магистров - 601-21м")

ABOUT_US_MESSAGE = ("Мы команда <b>Go Study.</b>\nМы студенты политехнического института СурГУ, "
                    "группы 609-22.\nНаш состав:\n<b> Олейник Анастасия\n Штанг Анна \n "
                    "Пузырев Данила \n Танеев Тамирлан \n Мишкин Максим</b>")

what_tt = "Тебе нужно расписание на сегодня, на завтра или на неделю?"

USER_REQUEST_TOMORROW = ['на завтра', 'завтра']

USER_REQUEST_TODAY = ['на сегодня', 'сегодня']

USER_REQUEST_WEEK = ['на неделю', 'неделю', 'неделя']

USER_REQUEST_STUDENT_TT = ['свое расписание', 'расписание', 'росписание', 'свое росписание',
                           'расаисани', 'расписан', 'распис', 'расп']

REQUEST_LECTURE_TT = ['расписание преподователя', 'преподователь', 'препадаватель',
                      'расписание препадователя', 'расписание преподавателя']

REQURST_CALLS_TT = "расписание звонков"

UPDATE_CONFIRM = "Вы действительно хотите сменить номер своей группы на "

SELECT_NAME_LECTURER = "Напиши фамилию преподавателя, расписание которого хочешь узнать"

WRONG_SELECT_NAME_LEC = "Проверьте правильность ввода\nНапиши фамилию преподавателя, расписание которого хочешь узнать"

FIND_LECTURER_NAME = ['узнать фио преподавателя', 'фио преподавателя', "узнать фио препадавателя",
                      'фио препадавателя', 'Узнать ФИО преподователя', 'Узнать ФИО преподавателя']

CHANGE_GROUP_NUMBER_SUCCESSFUL = "Номер вашей группы успешно изменен на "

CH_ZN_REQUEST = 'числитель / знаменатель'

GROUP_NUMBER_CHANGED = "Номер вашей группы успешно изменен на"

lecturers_names = ['галкин в.а.', 'гореликов а.в.', 'назин а.г.', 'рошкован к.с.', 'чалей и.в.', 'ряховский а.в.',
                   'быковских д.а.', 'бычин и.в.', 'шапошникова и.в.', 'аветисян м.г.', 'дубовик а.о.',
                   'мухутдинова д.р.', 'гимранов р.д.', 'латыпова о.ю.', 'ельников а.в.', 'коновалова е.в.',
                   'заводовский а.г.', 'лебедев с.л.', 'манина е.а.', 'сысоев с.м.', 'алексеев м.м.', 'швец е.с.',
                   'шадрин г.а.', 'петров е.а.', 'джариев и.э.', 'кузнецов в.е.', 'макеев а.а.', 'логинов в.а.',
                   'джалилов м.а.', 'мартынов с.и.', 'дёмко а.и.', 'демко а.и.', 'шошин е.л.', 'кислицин е.ю.',
                   'бурмистрова е.а.', 'алиев д.с.', 'прохорова е.в.', 'сальников в.г.', 'рыжаков м.в.',
                   'кондрашкина е.г.', 'рысев п.в.', 'рыжаков в.в.', 'семенов о.ю.', 'шевцов д.е.', 'семенова л.л.',
                   'бабкин а.ю.', 'антипин д.п.', 'мищенко в.в.', 'бородина е.а.', 'владимиров л..в.', 'евдокимов а.а.',
                   'чаппаров ф.х', 'уржумцев д.в.', 'лобанов п.в.', 'иванов г.в.', 'никитин к.и.', 'алиев ш.с.',
                   'бигун а.я.', 'острейковский в.а.', 'татьянкин в.м.', 'жебель в.а.', 'тарасенко т.п.',
                   'лысенкова с.а.', 'живайкин е.а.', 'назина н.б.', 'федоров д.а.', 'столбов д.а.', 'алмазова е.г',
                   'кучин и.а.', 'харламов с.а.', 'мялковская д.и.', 'еловой с.г.', 'заикин п.в.', 'шайторова и.а.',
                   'григоренко в.в.', 'павлык а.в.', 'брагинский м.я.', 'гришмановский п.в.', 'гришмановская о.н.',
                   'даниленко и.н.', 'запевалов а.в.', 'запевалова л.ю.', 'кузин д.а.', 'тараканов д.в.',
                   'кривицкая м.а.', 'паук е.н.', 'емельянов с.н.', 'инютин с.а.', 'назаров е.в.', 'кошкин с.с.',
                   'назарова и.л.', 'золотарева н.с.', 'гребенюк е.в.', 'джумалиева а.з.', 'луппов е.а.',
                   'горынин г.л.',
                   'соколов с.б.', 'исаков а.к.', 'насруллоев а.д.', 'галиев и.м.', 'соловьев с.в.', 'самакалев с.с.',
                   'сухомлинова а.л.', 'голышева н.ф.', 'покатиловский н.в.', 'снигирева в.а.', 'власко а.ф.',
                   'кузнецова т.а.', 'арискин м.в.', 'гордеев а.с.', 'бобровская о.п. ', 'волкова е.в.',
                   'румянцев а.с. ', 'румянцев а.с.', 'берестин д.к.', 'девицын и.н.', 'бушмелева к.и.',
                   'смородинов а.д.', 'гавриленко т.в.', 'горбунов д.в.', 'никифоров а.в.', 'юрчишина м.в.',
                   'гавриленко а.в.', 'урманцева н.р.', 'бурдыко т.г.', 'бушмелев п.е.', 'иванов ф.ф.', 'главин а.н.',
                   'увайсов с.у.']

lecturers_lastnames = ['галкин', 'гореликов', 'назин', 'рошкован', 'чалей', 'ряховский', 'быковских', 'бычин',
                       'шапошникова', 'аветисян', 'дубовик', 'мухутдинова', 'гимранов', 'латыпова', 'ельников',
                       'коновалова', 'заводовский', 'лебедев', 'манина', 'сысоев', 'алексеев', 'швец', 'шадрин',
                       'петров', 'джариев', 'кузнецов', 'макеев', 'логинов', 'джалилов', 'мартынов', 'дёмко', 'демко',
                       'шошин', 'кислицин', 'бурмистрова', 'алиев', 'прохорова', 'сальников', 'рыжаков', 'кондрашкина',
                       'рысев', 'рыжаков', 'семенов', 'шевцов', 'семенова', 'бабкин', 'антипин', 'мищенко', 'бородина',
                       'владимиров', 'евдокимов', 'чаппаров', 'уржумцев', 'лобанов', 'иванов', 'никитин', 'алиев',
                       'бигун', 'острейковский', 'татьянкин', 'жебель', 'тарасенко', 'лысенкова', 'живайкин', 'назина',
                       'федоров', 'столбов', 'алмазова', 'кучин', 'харламов', 'мялковская', 'еловой', 'заикин',
                       'шайторова', 'григоренко', 'павлык', 'брагинский', 'гришмановский', 'гришмановская', 'даниленко',
                       'запевалов', 'запевалова', 'кузин', 'тараканов', 'кривицкая', 'паук', 'емельянов', 'инютин',
                       'назаров', 'кошкин', 'назарова', 'золотарева', 'гребенюк', 'джумалиева', 'луппов', 'горынин',
                       'соколов', 'исаков', 'насруллоев', 'галиев', 'соловьев', 'самакалев', 'сухомлинова', 'голышева',
                       'покатиловский', 'снигирева', 'власко', 'кузнецова', 'арискин', 'гордеев', 'бобровская',
                       'волкова',
                       'румянцев', 'румянцев', 'берестин', 'девицын', 'бушмелева', 'смородинов', 'гавриленко',
                       'горбунов',
                       'никифоров', 'юрчишина', 'гавриленко', 'урманцева', 'бурдыко', 'бушмелев', 'иванов', 'главин',
                       'увайсов']

TT_cals = ("1. Расписание звонков в корпусах «А», «Г», «К» и «У»:\n\n"
           "1 пара	08:30-09:50	перерыв 10 минут\n"
           "2 пара	10:00-11:20	перерыв 10 минут\n"
           "3 пара	11:30-12:50	перерыв 30 минут\n"
           "4 пара	13:20-14:40	перерыв 10 минут\n"
           "5 пара	14:50-16:10	перерыв 10 минут\n"
           "6 пара	16:20-17:40	перерыв 20 минут\n"
           "7 пара	18:00-19:20	перерыв 10 минут\n"
           "8 пара	19:30-20:50	 \n\n"
           "2. Расписание звонков в спорткомплексе «Дружба»:\n\n"
           "1 пара	09:00-10:20	перерыв 10 минут\n"
           "2 пара	10:30-11:50	перерыв 10 минут\n"
           "3 пара	12:00-13:20	перерыв 10 минут\n"
           "4 пара	13:30-14:00	перерыв 10 минут\n"
           "5 пара	15:00-16:20	перерыв 10 минут\n"
           "6 пара	16:30-17:50\n\n"
           "3. Расписание звонков в плавательном бассейне «Водолей»:\n\n"
           "1 пара	11:00-11:45\n"
           "2 пара	11:45-12:30\n"
           "3 пара	12:30-13:15\n"
           "4 пара	13:15-14:00\n"
           )


CURRENT_LEC_TIME_REQUEST = 'Какая сейчас пара'


groups = ["601-21", "601-21м", "602-21", "602-21м", "603-21", "603-22", "603-21м", "604-21", "604-21м", "605-21",
          "605-21м", "606-21", "606-22", "606-21м", "607-21", "607-22", "607-21м", "608-21", "608-22", "608-21м",
          "609-21", "609-22", "601-11", "601-11м", "602-11", "602-11м", "603-11", "603-11м", "604-11", "604-11м",
          "605-11", "605-11м", "606-11", "606-12", "606-11м", "607-11", "607-12", "607-11м", "608-11", "608-12",
          "608-11м", "609-11", "609-12", "603-12", "601-01", "602-01", "603-01", "603-02", "604-01", "605-01", "606-01", "607-01",
          "608-01", "608-02", "609-01", "601-91", "602-91", "603-91", "603-92", "604-91", "605-91", "606-91", "607-91",
          "608-91", "608-92", "609-91"]

group_number_fall = "Вы ввели неправильный номер группы, пожалуйста попробуйте еще раз"